# 1) Load the dependencies

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

import statsmodels.formula.api as smf

import warnings
warnings.filterwarnings("ignore")

# 2) Load the dataset

In [2]:
news = pd.read_csv("NewspaperData.csv")
news.head()

            Newspaper    daily   sunday
0       Baltimore Sun  391.952  488.506
1        Boston Globe  516.981  798.298
2       Boston Herald  355.628  235.084
3  Charlotte Observer  238.555  299.451
4   Chicago Sun Times  537.780  559.093

In [3]:
news.tail()

                  Newspaper    daily    sunday
29  San Francisco Chronicle  570.364   704.322
30  St. Louis Post-Dispatch  391.286   585.681
31   St. Paul Pioneer Press  201.860   267.781
32            Tampa Tribune  321.626   408.343
33          Washington Post  838.902  1165.567

# hypothesis here:
# wether daily and sunday sale is more, than that newspapaer is top in the market
# whether 'daily' is more and 'sunday' is less

# 3) Descriptive Statistics

In [4]:
# How big is the data?
print(f'Rows: {news.shape[0]}\nColumns : {news.shape[1]}')    
#34 newspaper

Rows: 34
Columns : 3

In [5]:
# How does the data look like?

news.sample(5)

                         Newspaper     daily    sunday
26  Rochester Democrat & Chronicle   133.239   262.048
13               Los Angeles Times  1164.388  1531.527
24              Portland Oregonian   337.672   440.923
27             Rocky Mountain News   374.009   432.502
9                 Hartford Courant   231.177   323.084

In [6]:
# What is the data type of cols? 

news.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Newspaper  34 non-null     object
 1   daily      34 non-null     float64
 2   sunday     34 non-null     float64
dtypes: float64(2), object(1)
memory usage: 944.0+ bytes

In [7]:
# Are there any missing values?

news.isnull().sum()

Newspaper    0
daily        0
sunday       0
dtype: int64

In [8]:
# How does the data look mathematically?

news.describe().T

,count,mean,std,min,25%,50%,75%,max
daily,34.0,430.962471,269.211470,133.239,233.0215,355.2355,516.61650,1209.225
sunday,34.0,591.202412,376.418051,202.614,327.7695,436.7125,699.73525,1762.015

In [9]:
# Are there duplicate values?

news.duplicated().sum()

0

In [10]:
# How is the correlation between cols?- Correlation

# We have loaded the dataset for Mini Challenges below in the variable 'data' 
# Sales is the target variable and the rest are predictors 

news.corr()

           daily    sunday
daily   1.000000  0.958154
sunday  0.958154  1.000000